
import newsImageOne from '../../../assets/img/newsImageOne.png';
import newsImageTwo from '../../../assets/img/newsImageTwo.svg';
import newsImageThree from '../../../assets/img/newsImageThree.svg';
import newsImageFour from '../../../assets/img/newsImageFour.svg';
import newsImageFive from '../../../assets/img/newsImageFive.svg';

const NavisNewsDetailPageData = [
    {
        id: 1,
        type: 'featured',
        image: newsImageOne,
        title: 'Команда отец-сын говорит, что им удалось восстановить $6 млн утраченной криптовалюты',
        date: '11.06.2024 12:30'
    },
    {
        id: 2,
        type: 'regular',
        image: newsImageTwo,
        title: 'Команда отец-сын говорит, что им удалось восстановить $6 млн утраченной криптовалюты',
        date: '11.06.2024 12:30'
    },
    {
        id: 3,
        type: 'regular',
        image: newsImageThree,
        title: 'Команда отец-сын говорит, что им удалось восстановить $6 млн утраченной криптовалюты',
        date: '11.06.2024 12:30'
    },
    {
        id: 4,
        type: 'regular',
        image: newsImageFour,
        title: 'Команда отец-сын говорит, что им удалось восстановить $6 млн утраченной криптовалюты',
        date: '11.06.2024 12:30'
    },
    {
        id: 5,
        type: 'regular',
        image: newsImageFive,
        title: 'Команда отец-сын говорит, что им удалось восстановить $6 млн утраченной криптовалюты',
        date: '11.06.2024 12:30'
    },
    {
        id: 6,
        type: 'regularRight',
        description: 'Президент Найиб Букеле из Сальвадора указал, что запасы биткойнов его страны могут превышать публичные оценки. Он раскрыл, что Сальвадор получает доходы, связанные с биткойном, из различных источников, в дополнение к капитальным приростам от покупок биткойна с момента его легализации в качестве законного платежного средства в стране.',
    },
    {
        id: 7,
        type: 'regularRight',
        news: '‘Сальвадор – страна биткойна’',
        description: 'Президент Сальвадора Найиб Букеле указал, что его страна имеет несколько источников дохода от биткойна, в дополнение к прибыли, полученной от резервов биткойна, купленных после того, как страна сделала BTC законным платежным средством наряду с долларом США в сентябре 2021 года.В сообщении на социальной платформе X в понедельник он написал, что Сальвадор получает доходы, связанные с биткойном, от своей программы паспортов, конвертации BTC в USD для местных бизнесов, майнинга и государственных услуг. Президент Сальвадора предоставил эту информацию в ответ на сообщение от Crypto Rover о том, что страна получила прибыль в 83 миллиона долларов от своей стратегии инвестирования в биткойн.',
    },
]

export default NavisNewsDetailPageData;